; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          airplane - vehicle
          package
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?loc - place ?city - city)
		(at ?obj - physobj ?loc - place)
		(in ?pkg - package ?veh - vehicle)
		(city ?city - city))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (not (at ?truck ?loc-to)) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (and (at ?airplane ?loc-from) (not (at ?airplane ?loc-to)))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)

)

; problem
(define (problem p01)
(:domain logistics)
(:objects
    plane1 - airplane
    pos1_1 pos2_1 pos3_1 pos4_1 - airport
    pos1_2 pos1_3 pos1_4   pos2_2 pos2_3   pos3_2 pos3_3   pos4_2 pos4_3 pos4_4 - location
    city1 city2 city3 city4 - city
    truck1 truck2 truck3 truck4 - truck
    pkg1 pkg2 pkg3 pkg4 pkg5 pkg6 - package
    background
)
(:init 
    (at plane1 pos2_1)
    (at truck1 pos1_1)
    (at truck2 pos2_1)
    (at truck3 pos3_1)
    (at truck4 pos4_1)
    (at pkg1 pos1_2)
    (at pkg2 pos1_2)
    (at pkg3 pos1_3)
    (at pkg4 pos1_3)
    (at pkg5 pos1_4)
    (at pkg6 pos1_4)
    (in-city pos1_1 city1)
    (in-city pos1_2 city1)
    (in-city pos1_3 city1)
    (in-city pos1_4 city1)
    (in-city pos2_1 city2)
    (in-city pos2_2 city2)
    (in-city pos2_3 city2)
    (in-city pos3_1 city3)
    (in-city pos3_2 city3)
    (in-city pos3_3 city3)
    (in-city pos4_1 city4)
    (in-city pos4_2 city4)
    (in-city pos4_3 city4)
    (in-city pos4_4 city4)
    (city city1)
    (city city2)
    (city city3)
    (city city4)
)
(:goal 
	(and (at pkg1 pos3_2) (at pkg2 pos3_2))
)
)

; plan
1. (drive-truck truck1 pos1_1 pos1_2 city1)
   deleted: (at truck1 pos1_1)
   added: (at truck1 pos1_2)
   goals met: 0 of 2
2. (load-truck pkg2 truck1 pos1_2)
   deleted: (at pkg2 pos1_2)
   added: (in pkg2 truck1)
   goals met: 0 of 2
3. (fly-airplane plane1 pos2_1 pos1_1)
   deleted: (at plane1 pos2_1)
   added: (at plane1 pos1_1)
   goals met: 0 of 2
4. (load-truck pkg1 truck1 pos1_2)
   deleted: (at pkg1 pos1_2)
   added: (in pkg1 truck1)
   goals met: 0 of 2
5. (drive-truck truck1 pos1_2 pos1_1 city1)
   deleted: (at truck1 pos1_2)
   added: (at truck1 pos1_1)
   goals met: 0 of 2
6. (unload-truck pkg1 truck1 pos1_1)
   deleted: (in pkg1 truck1)
   added: (at pkg1 pos1_1)
   goals met: 0 of 2
7. (load-airplane pkg1 plane1 pos1_1)
   deleted: (at pkg1 pos1_1)
   added: (in pkg1 plane1)
   goals met: 0 of 2
8. (unload-truck pkg2 truck1 pos1_1)
   deleted: (in pkg2 truck1)
   added: (at pkg2 pos1_1)
   goals met: 0 of 2
9. (load-airplane pkg2 plane1 pos1_1)
   deleted: (at pkg2 pos1_1)
   added: (in pkg2 plane1)
   goals met: 0 of 2
10. (fly-airplane plane1 pos1_1 pos3_1)
   deleted: (at plane1 pos1_1)
   added: (at plane1 pos3_1)
   goals met: 0 of 2
11. (unload-airplane pkg1 plane1 pos3_1)
   deleted: (in pkg1 plane1)
   added: (at pkg1 pos3_1)
   goals met: 0 of 2
12. (load-truck pkg1 truck3 pos3_1)
   deleted: (at pkg1 pos3_1)
   added: (in pkg1 truck3)
   goals met: 0 of 2
13. (unload-airplane pkg2 plane1 pos3_1)
   deleted: (in pkg2 plane1)
   added: (at pkg2 pos3_1)
   goals met: 0 of 2
14. (load-truck pkg2 truck3 pos3_1)
   deleted: (at pkg2 pos3_1)
   added: (in pkg2 truck3)
   goals met: 0 of 2
15. (drive-truck truck3 pos3_1 pos3_2 city3)
   deleted: (at truck3 pos3_1)
   added: (at truck3 pos3_2)
   goals met: 0 of 2
16. (unload-truck pkg1 truck3 pos3_2)
   deleted: (in pkg1 truck3)
   added: (at pkg1 pos3_2)
   goals met: 1 of 2
17. (unload-truck pkg2 truck3 pos3_2)
   deleted: (in pkg2 truck3)
   added: (at pkg2 pos3_2)
   goals met: 2 of 2
